src/Documents/ПротоколКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПротоколКомиссии</Name>
			<BasedOn>
				<xr:Item>Document.ОтпускПоУходуЗаРебенком</xr:Item>
				<xr:Item>Document.НачислениеПоБольничномуЛисту</xr:Item>
				<xr:Item>Document.НачислениеПоБольничномуЛистуПоДоговорамПодряда</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПротокола</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПротокола</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРожденияРебенка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПособияДоПолутораЛет</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПособияДоПолутораЛет</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПособияДоТрехЛет</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПособияДоТрехЛет</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчетаДоПолутораЛет</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчетаДоТрехЛет</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПособияДоПолутораЛет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПособияДотрехЛет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаБ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияБ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНетрудоспособности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныНетрудоспособности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обстоятельства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНетрудоспособность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПоУходу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативноПравовойАкт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРебенка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пособия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисленияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель1</Name>
							<Comment>Процент оплаты</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПособияОсн</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ГосударственныеПособия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГосударственныеПособия</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НормативРазмераПособия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидПособия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыГосударственныхПособий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыГосударственныхПособий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыГосударственныхПособий</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриРожденииРебенка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриПостановкеНаУчетВРанниеСрокиБеременности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаРебенкаДо3Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаРебенкаСтарше3Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриУсыновленииРебенка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МинимумПособияПоУходуЗаПервымРебенкомДоПолутораЛет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МинимумПособияПоУходуЗаПоследующимРебенкомДоПолутораЛет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимумПособияПоУходуЗаРебенкомДоПолутораЛет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеМатериОдиночкеДо1_5Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеМатериОдиночкеДо3Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиенаРебенкаСНадбавкой40До3Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНеРаботающейМатериДо3Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНеРабМатериОдиночкеДо1_5Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНеРабМатериОдиночкеДо3Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНеРабМатериНадб40До3Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаРебенкаДо18ЛетНадб40</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаРебенкаИнвалида</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаВичИнфицРебенка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСвязиСоСмертью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриРожденииВторогоИПоследующихДетей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаДетейВВозрастеОт3До18</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаВторогоИПоследующихДо3Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПротоколКомиссии/Ext/ObjectModule.bsl
// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	Если ЭтоНетрудоспособность Тогда 
		СтруктураПечатныхФорм.Вставить("Макет1",	"Печать для нетрудоспособности");
	иначе
		СтруктураПечатныхФорм.Вставить("Макет",	"Печать для пособий");
	КонецЕсли;
		
	Возврат СтруктураПечатныхФорм;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтпускПоУходуЗаРебенком") Тогда
		// Заполнение шапки
		ЭтоНетрудоспособность = Ложь;
		//О.Т. Аверсон 26.04.2018 № 1909
		//ВидРасчетаДоПолутораЛет = ДанныеЗаполнения.ВидРасчетаДоПолутораЛет;
		//ВидРасчетаДоТрехЛет = ДанныеЗаполнения.ВидРасчетаДоТрехЛет;
		//ДатаОкончанияПособияДоПолутораЛет = ДанныеЗаполнения.ДатаОкончанияПособияДоПолутораЛет;
		//ДатаОкончанияПособияДоТрехЛет = ДанныеЗаполнения.ДатаОкончанияПособияДоТрехЛет;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		//ПроцентПособияДоПолутораЛет = ДанныеЗаполнения.ПроцентПособияДоПолутораЛет;
		//ПроцентПособияДотрехЛет = ДанныеЗаполнения.ПроцентПособияДотрехЛет;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		Физлицо = ДанныеЗаполнения.Физлицо;
		//О.Т. Аверсон 26.04.2018 № 1909
		//Если ЗначениеЗаполнено(ДанныеЗаполнения.ДатаОкончанияПособияДоПолутораЛет) Тогда 
		ДатаНачалаПособияДоПолутораЛет = ДанныеЗаполнения.ДатаНачала;
		ДатаОкончанияПоУходу = ДанныеЗаполнения.ДатаОкончания; 
		//КонецЕсли;
		//Если ЗначениеЗаполнено(ДанныеЗаполнения.ВидРасчетаДоТрехЛет) Тогда 
		//	ДатаНачалаПособияДоТрехЛет = ДанныеЗаполнения.ДатаНачала;
		//КонецЕсли;
		НомерПротокола = ДанныеЗаполнения.НомерПриказаОбОкончанииОтпускаПл;
		ДатаПротокола = ДанныеЗаполнения.ДатаПриказаОбОкончанииОтпускаПл;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеПоБольничномуЛисту") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеПоБольничномуЛистуПоДоговорамПодряда") Тогда //Аверсон 16.12.2021 КВВ СВФР-008498
		// Заполнение шапки
		ДатаНачалаБ = ДанныеЗаполнения.ДатаНачала;
		ДатаОкончанияБ = ДанныеЗаполнения.ДатаОкончания;
		Комментарий = ДанныеЗаполнения.Комментарий;
		НомерВходящегоДокумента = ДанныеЗаполнения.НомерВходящегоДокумента;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		ПричинаНетрудоспособности = ДанныеЗаполнения.ПричинаНетрудоспособности;
		СерияВходящегоДокумента = ДанныеЗаполнения.СерияВходящегоДокумента;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		Физлицо = ДанныеЗаполнения.Физлицо;
		ЭтоНетрудоспособность = истина;
		ПодразделениеОрганизации = ДанныеЗаполнения.ПодразделениеОрганизации; //Аверсон 16.12.2021 КВВ СВФР-008498
		Для Каждого ТекСтрокаНачисления Из ДанныеЗаполнения.Начисления Цикл
			НоваяСтрока = Оплата.Добавить();
			НоваяСтрока.ДатаНачала = ТекСтрокаНачисления.ДатаНачала;
			НоваяСтрока.ДатаОкончания = ТекСтрокаНачисления.ДатаОкончания;
			НоваяСтрока.Показатель1 = ТекСтрокаНачисления.Показатель1;
		КонецЦикла;	
	КонецЕсли;
	
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура Печать(Имя) Экспорт
	
	Если Имя = "Макет" и не ЭтоНетрудоспособность Тогда 
		ТабДок = ПечатьМакетаПоУходу(Имя);
	ИначеЕсли Имя = "Макет" Тогда 
		ТабДок = ПечатьМакета(Имя);  
	иначе
		ТабДок = ПечатьМакета1(Имя);  
	КонецЕсли;
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать(); 	
	
КонецПроцедуры

Функция ПечатьМакета(Имя) экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.ПротоколКомиссии.ПолучитьМакет("Макет");
	// Заголовок
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	ОбластьЗаголовок.Параметры.Организация = Организация;
	ОбластьЗаголовок.Параметры.НомерПротокола = НомерПротокола;
	ОбластьЗаголовок.Параметры.ДатаПротокола = Формат(ДатаПротокола,"ДЛФ=Д");
	ФИО = Сотрудник.Наименование;
	ФИО = СтрЗаменить(ФИО,"Ё","Е");
	ФИОРод = ФИО;
	ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОРод, 2, Сотрудник.Физлицо.Пол,ФИОРод);
	ОбластьЗаголовок.Параметры.ФИОРод = ФИОРод;
	
	ФИОДат = ФИО;
	ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОДат, 3, Сотрудник.Физлицо.Пол,ФИОДат);
	ОбластьЗаголовок.Параметры.ФИОДат = ФИОДат;
	Разделитель = "";
	СписокПособий = "";
	Сч = 0;
	Для Каждого стр из Пособия Цикл 
		Если сч = 1 Тогда 
			Разделитель = ", ";
		КонецЕсли;
		СписокПособий = СписокПособий + Разделитель + стр.ВидРасчета.Наименование;
		
		сч = 1;
	КонецЦикла;
	Для Каждого стр из ПособияОсн Цикл 
		Если сч = 1 Тогда 
			Разделитель = ", ";
		КонецЕсли;
		СписокПособий = СписокПособий + Разделитель + стр.ВидРасчета.Наименование;
		
		сч = 1;
	КонецЦикла; 
	ОбластьЗаголовок.Параметры.СписокПособий = СписокПособий;
	
	МассивПособие12Недель = Пособия.НайтиСтроки(Новый Структура("ВидРасчета",ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриПостановкеНаУчетВРанниеСрокиБеременности)); 
	Если МассивПособие12Недель.Количество()>0 Тогда 
		Размер12Недель = РегистрыСведений.ГосударственныеПособия.ПолучитьПоследнее(ДатаПротокола,Новый Структура("ВидПособия",Перечисления.ВидыГосударственныхПособий.ПриПостановкеНаУчетВРанниеСрокиБеременности)).Размер; 
		ОбластьЗаголовок.Параметры.Размер12Недель = Размер12Недель;
		ФормСтрока = "Л = ru_RU; ДП = Истина";
		ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
		ОбластьЗаголовок.Параметры.НедельПрописью = "("+ЧислоПрописью(Размер12Недель,ФормСтрока,ПарПредмета)+")";
		ОбластьЗаголовок.Параметры.Пособие12Недель = Перечисления.ВидыГосударственныхПособий.ПриПостановкеНаУчетВРанниеСрокиБеременности;
	КонецЕсли; 
	
	МассивПриРождении = Пособия.НайтиСтроки(Новый Структура("ВидРасчета",ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриРожденииРебенка)); 
	Если МассивПриРождении.Количество()>0 Тогда 
		Если МассивПособие12Недель.Количество()>0 Тогда
			
			РазмерПриРождении = РегистрыСведений.ГосударственныеПособия.ПолучитьПоследнее(ДатаПротокола,Новый Структура("ВидПособия",Перечисления.ВидыГосударственныхПособий.ПриРожденииРебенка)).Размер; 
			ОбластьЗаголовок.Параметры.РазмерРождение = РазмерПриРождении;
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
			ОбластьЗаголовок.Параметры.ПриРожденииПрописью = "("+ЧислоПрописью(РазмерПриРождении,ФормСтрока,ПарПредмета)+")";
			
			ОбластьЗаголовок.Параметры.ПособиеРождение = Перечисления.ВидыГосударственныхПособий.ПриРожденииРебенка;
		иначе
			РазмерПриРождении = РегистрыСведений.ГосударственныеПособия.ПолучитьПоследнее(ДатаПротокола,Новый Структура("ВидПособия",Перечисления.ВидыГосударственныхПособий.ПриРожденииРебенка)).Размер; 
			ОбластьЗаголовок.Параметры.Размер12Недель = РазмерПриРождении;
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
			ОбластьЗаголовок.Параметры.НедельПрописью = "("+ЧислоПрописью(РазмерПриРождении,ФормСтрока,ПарПредмета)+")";
			ОбластьЗаголовок.Параметры.Пособие12Недель = Перечисления.ВидыГосударственныхПособий.ПриРожденииРебенка;
			
		КонецЕсли;
	КонецЕсли;
	
	ОбластьЗаголовок.Параметры.ВидыПособияДо3Лет = ВидРасчетаДоТрехЛет.Наименование; // ВидРасчетаДоПолутораЛет.Наименование + " " +
	Если ЗначениеЗаполнено(ВидРасчетаДоПолутораЛет) Тогда 
		ОбластьЗаголовок.Параметры.Проц1 = ПроцентПособияДоПолутораЛет;
		ОбластьЗаголовок.Параметры.Проц2 = ПроцентПособияДотрехЛет;
		ОбластьЗаголовок.Параметры.ДатаПособияНач1 = Формат(ДатаНачалаПособияДоПолутораЛет,"ДЛФ=Д");
		ОбластьЗаголовок.Параметры.ДатаПособияКон1 = Формат(ДатаНачалаПособияДоПолутораЛет,"ДЛФ=Д");
		ОбластьЗаголовок.Параметры.ДатаРождения = "на  , " + Формат(ДатаРожденияРебенка,"ДЛФ=Д")+" г.";
		ОбластьЗаголовок.Параметры.ДатаПособияНач2 = Формат(ДатаНачалаПособияДоТрехЛет,"ДЛФ=Д");
		ОбластьЗаголовок.Параметры.ДатаПособияКон2 = Формат(ДатаОкончанияПособияДоТрехЛет,"ДЛФ=Д");
		ОбластьЗаголовок.Параметры.ДатаРождения2 = "на  , " + Формат(ДатаРожденияРебенка,"ДЛФ=Д")+" г.";

	иначе
		ОбластьЗаголовок.Параметры.Проц1 = ПроцентПособияДотрехЛет;
		ОбластьЗаголовок.Параметры.ДатаПособияНач1 = Формат(ДатаНачалаПособияДоТрехЛет,"ДЛФ=Д");
		ОбластьЗаголовок.Параметры.ДатаПособияКон1 = Формат(ДатаОкончанияПособияДоТрехЛет,"ДЛФ=Д");
		ОбластьЗаголовок.Параметры.ДатаРождения = "на  , " + Формат(ДатаРожденияРебенка,"ДЛФ=Д")+" г.";

	КонецЕсли;
	
	
	//О.Т. Аверсон 06.12.2018 № 2879
	//ЗначениеПредседатель = ВосстановитьЗначение("СотрудникПредседатель");
	//Председатель = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеПредседатель.Наименование);
	//ОбластьЗаголовок.Параметры.Председатель = Председатель;
	//ЗначениеК = ВосстановитьЗначение("СотрудникКомиссия1");
	//ЗначК = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК.Наименование);
	//ОбластьЗаголовок.Параметры.Комиссия1 = ЗначК;
	//ЗначениеК = ВосстановитьЗначение("СотрудникКомиссия2");
	//ЗначК = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК.Наименование);
	//ОбластьЗаголовок.Параметры.Комиссия2 = ЗначК;
	//ЗначениеК = ВосстановитьЗначение("СотрудникКомиссия3");
	//ЗначК = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК.Наименование);
	//ОбластьЗаголовок.Параметры.Комиссия3 = ЗначК;
	//О.Т. Аверсон 06.12.2018 № 2879
	//Аверсон 20.10.2021 КВВ СВФР-008283 (
	Председатель = "";  ЗначК1 = ""; ЗначК2 = "";  ЗначК3 = "";
	ОргНаим = ?(СколькоОрганизаций()=1,"",СокрЛП(Организация.Наименование));
	ЗначениеПредседатель = ВосстановитьЗначение("СотрудникПредседатель"+ОргНаим);
	Если ЗначениеПредседатель <> Неопределено Тогда
		Председатель = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеПредседатель.Наименование);
	КонецЕсли;
	ОбластьЗаголовок.Параметры.Председатель = Председатель;
	
	ЗначениеК1 = ВосстановитьЗначение("СотрудникКомиссия1"+ОргНаим);
	Если ЗначениеК1 <> Неопределено Тогда
		ЗначК1 = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК1.Наименование);
	КонецЕсли;
	ОбластьЗаголовок.Параметры.Комиссия1 = ЗначК1;
	
	ЗначениеК2 = ВосстановитьЗначение("СотрудникКомиссия2"+ОргНаим);
	Если ЗначениеК2 <> Неопределено Тогда
		ЗначК2 = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК2.Наименование);
		ОбластьЗаголовок.Параметры.Комиссия2 = ЗначК2;
	КонецЕсли;
	
	ЗначениеК3 = ВосстановитьЗначение("СотрудникКомиссия3"+ОргНаим);
	Если ЗначениеК3 <> Неопределено Тогда
		ЗначК3 = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК3.Наименование);
		ОбластьЗаголовок.Параметры.Комиссия3 = ЗначК3;
	КонецЕсли;
	//Аверсон 20.10.2021 КВВ СВФР-008283 )
	
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
		
	
	Возврат ТабДок;
	
	
КонецФункции

Функция ПечатьМакетаПоУходу(Имя) экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.ПротоколКомиссии.ПолучитьМакет("МакетПоУходу");
	// Заголовок
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок1 = Макет.ПолучитьОбласть("Заголовок1");
	ОбластьДетали = Макет.ПолучитьОбласть("Детали");


	
	ОбластьЗаголовок.Параметры.Организация = Организация;
	ОбластьЗаголовок.Параметры.НомерПротокола = НомерПротокола;
	ОбластьЗаголовок.Параметры.ДатаПротокола = Формат(ДатаПротокола,"ДЛФ=Д");
	ФИО = Сотрудник.Наименование;
	ФИО = СтрЗаменить(ФИО,"Ё","Е");
	ФИОРод = ФИО;
	ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОРод, 2, Сотрудник.Физлицо.Пол,ФИОРод);
	ОбластьЗаголовок.Параметры.ФИОРод = ФИОРод;
	
	ФИОДат = ФИО;
	ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОДат, 3, Сотрудник.Физлицо.Пол,ФИОДат);
	ОбластьЗаголовок.Параметры.ФИОДат = ФИОДат;
	Разделитель = "";
	СписокПособий = "";
	Сч = 0;
	Для Каждого стр из Пособия Цикл 
		Если сч = 1 Тогда 
			Разделитель = ", ";
		КонецЕсли;
		СписокПособий = СписокПособий + Разделитель + стр.ВидРасчета.Наименование;
		
		сч = 1;
	КонецЦикла;
	Для Каждого стр из ПособияОсн Цикл 
		Если сч = 1 Тогда 
			Разделитель = ", ";
		КонецЕсли;
		СписокПособий = СписокПособий + Разделитель + стр.ВидРасчета.Наименование;
		
		сч = 1;
	КонецЦикла; 
	ОбластьЗаголовок.Параметры.СписокПособий = СписокПособий;
	
	МассивПособие12Недель = Пособия.НайтиСтроки(Новый Структура("ВидРасчета",ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриПостановкеНаУчетВРанниеСрокиБеременности)); 
	Если МассивПособие12Недель.Количество()>0 Тогда 
		Размер12Недель = РегистрыСведений.ГосударственныеПособия.ПолучитьПоследнее(ДатаПротокола,Новый Структура("ВидПособия",Перечисления.ВидыГосударственныхПособий.ПриПостановкеНаУчетВРанниеСрокиБеременности)).Размер; 
		ОбластьЗаголовок.Параметры.Размер12Недель = Размер12Недель;
		ФормСтрока = "Л = ru_RU; ДП = Истина";
		ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
		ОбластьЗаголовок.Параметры.НедельПрописью = "("+ЧислоПрописью(Размер12Недель,ФормСтрока,ПарПредмета)+")";
		ОбластьЗаголовок.Параметры.Пособие12Недель = Перечисления.ВидыГосударственныхПособий.ПриПостановкеНаУчетВРанниеСрокиБеременности;
	КонецЕсли; 
	
	МассивПриРождении = Пособия.НайтиСтроки(Новый Структура("ВидРасчета",ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриРожденииРебенка)); 
	Если МассивПриРождении.Количество()>0 Тогда 
		Если МассивПособие12Недель.Количество()>0 Тогда
			
			РазмерПриРождении = РегистрыСведений.ГосударственныеПособия.ПолучитьПоследнее(ДатаПротокола,Новый Структура("ВидПособия",Перечисления.ВидыГосударственныхПособий.ПриРожденииРебенка)).Размер; 
			ОбластьЗаголовок.Параметры.РазмерРождение = РазмерПриРождении;
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
			ОбластьЗаголовок.Параметры.ПриРожденииПрописью = "("+ЧислоПрописью(РазмерПриРождении,ФормСтрока,ПарПредмета)+")";
			
			ОбластьЗаголовок.Параметры.ПособиеРождение = Перечисления.ВидыГосударственныхПособий.ПриРожденииРебенка;
		иначе
			РазмерПриРождении = РегистрыСведений.ГосударственныеПособия.ПолучитьПоследнее(ДатаПротокола,Новый Структура("ВидПособия",Перечисления.ВидыГосударственныхПособий.ПриРожденииРебенка)).Размер; 
			ОбластьЗаголовок.Параметры.Размер12Недель = РазмерПриРождении;
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
			ОбластьЗаголовок.Параметры.НедельПрописью = "("+ЧислоПрописью(РазмерПриРождении,ФормСтрока,ПарПредмета)+")";
			ОбластьЗаголовок.Параметры.Пособие12Недель = Перечисления.ВидыГосударственныхПособий.ПриРожденииРебенка;
			
		КонецЕсли;
	Иначе 
		МассивПриРождении = Пособия.НайтиСтроки(Новый Структура("ВидРасчета",ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриРожденииВторогоИПоследующихДетей)); 
		Если МассивПриРождении.Количество()>0 Тогда 
			Если МассивПособие12Недель.Количество()>0 Тогда
				
				РазмерПриРождении = РегистрыСведений.ГосударственныеПособия.ПолучитьПоследнее(ДатаПротокола,Новый Структура("ВидПособия",Перечисления.ВидыГосударственныхПособий.ПриРожденииВторогоИПоследующихДетей)).Размер; 
				ОбластьЗаголовок.Параметры.РазмерРождение = РазмерПриРождении;
				ФормСтрока = "Л = ru_RU; ДП = Истина";
				ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
				ОбластьЗаголовок.Параметры.ПриРожденииПрописью = "("+ЧислоПрописью(РазмерПриРождении,ФормСтрока,ПарПредмета)+")";
				
				ОбластьЗаголовок.Параметры.ПособиеРождение = Перечисления.ВидыГосударственныхПособий.ПриРожденииРебенка;
			иначе
				РазмерПриРождении = РегистрыСведений.ГосударственныеПособия.ПолучитьПоследнее(ДатаПротокола,Новый Структура("ВидПособия",Перечисления.ВидыГосударственныхПособий.ПриРожденииВторогоИПоследующихДетей)).Размер; 
				ОбластьЗаголовок.Параметры.Размер12Недель = РазмерПриРождении;
				ФормСтрока = "Л = ru_RU; ДП = Истина";
				ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
				ОбластьЗаголовок.Параметры.НедельПрописью = "("+ЧислоПрописью(РазмерПриРождении,ФормСтрока,ПарПредмета)+")";
				ОбластьЗаголовок.Параметры.Пособие12Недель = Перечисления.ВидыГосударственныхПособий.ПриРожденииРебенка;
				
			КонецЕсли;   
		КонецЕсли;
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	
	Для Каждого стр из ПособияОсн Цикл 
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГосударственныеПособияСрезПоследних.НормативРазмераПособия
		|ИЗ
		|	РегистрСведений.ГосударственныеПособия.СрезПоследних(&Период, ) КАК ГосударственныеПособияСрезПоследних
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаДетейВВозрастеОт3До18)
		|				ТОГДА ГосударственныеПособияСрезПоследних.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаДетейВВозрастеОт3До18)
		|			КОГДА &СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаВторогоИПоследующихДо3Лет)
		|				ТОГДА ГосударственныеПособияСрезПоследних.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаВторогоИПоследующихДо3Лет)
		|			КОГДА &СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей)
		|				ТОГДА ГосударственныеПособияСрезПоследних.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей)
		|			КОГДА &СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид)
		|				ТОГДА ГосударственныеПособияСрезПоследних.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид)
		|			КОГДА &СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо3Лет)
		|				ТОГДА ГосударственныеПособияСрезПоследних.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаДо3Лет)
		|			КОГДА &СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаДетейВВозрастеОт3До18)
		|				ТОГДА ГосударственныеПособияСрезПоследних.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаДетейВВозрастеОт3До18)
		|			КОГДА &СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаВторогоИПоследующихДо3Лет)
		|				ТОГДА ГосударственныеПособияСрезПоследних.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаВторогоИПоследующихДо3Лет)
		|			КОГДА &СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей)
		|				ТОГДА ГосударственныеПособияСрезПоследних.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей)
		|			КОГДА &СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид)
		|				ТОГДА ГосударственныеПособияСрезПоследних.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид)
		|			КОГДА &СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо18ЛетНадб40)
		|				ТОГДА ГосударственныеПособияСрезПоследних.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаДо18ЛетНадб40)
		|			КОГДА &СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаИнвалида)
		|				ТОГДА ГосударственныеПособияСрезПоследних.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаИнвалида)
		|			КОГДА &СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо3Лет)
		|				ТОГДА ГосударственныеПособияСрезПоследних.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаДо3Лет)
		|			КОГДА &СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаСтарше3Лет)
		|				ТОГДА ГосударственныеПособияСрезПоследних.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаСтарше3Лет)
		|		КОНЕЦ";
		
		Запрос.УстановитьПараметр("Период", КонецМесяца(Дата));
		Запрос.УстановитьПараметр("СпособРасчета", стр.ВидРасчета.СпособРасчета);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Норматив = "";
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Норматив = ВыборкаДетальныеЗаписи.НормативРазмераПособия;
		КонецЦикла;
		

		
		СтрокаПособия = стр.ВидРасчета.Наименование +", "+имяребенка +", " + Формат(ДатаРожденияРебенка,"ДЛФ=Д")+" г.";
		
		ОбластьДетали.Параметры.СтрокаПособия = СтрокаПособия;
		ОбластьДетали.Параметры.Процент = стр.Процент;
		ОбластьДетали.Параметры.ДатаНач = Формат(стр.НачалоПериода,"ДЛФ=Д");
		ОбластьДетали.Параметры.ДатаКон = Формат(стр.КонецПериода,"ДЛФ=Д");
		
		ОбластьДетали.Параметры.НормативРазмераПособия = Норматив;


		
		ТабДок.Вывести(ОбластьДетали);
	КонецЦикла;
	
	
	//О.Т. Аверсон 06.12.2018 № 2879
	//ЗначениеПредседатель = ВосстановитьЗначение("СотрудникПредседатель");
	//Председатель = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеПредседатель.Наименование);
	//ОбластьЗаголовок1.Параметры.Председатель = Председатель;
	//ЗначениеК = ВосстановитьЗначение("СотрудникКомиссия1");
	//ЗначК = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК.Наименование);
	//ОбластьЗаголовок1.Параметры.Комиссия1 = ЗначК;
	//ЗначениеК = ВосстановитьЗначение("СотрудникКомиссия2");
	//ЗначК = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК.Наименование);
	//ОбластьЗаголовок1.Параметры.Комиссия2 = ЗначК;
	//ЗначениеК = ВосстановитьЗначение("СотрудникКомиссия3");
	//ЗначК = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК.Наименование);
	//ОбластьЗаголовок1.Параметры.Комиссия3 = ЗначК;
	//О.Т. Аверсон 06.12.2018 № 2879
	//Аверсон 20.10.2021 КВВ СВФР-008283 (
	Председатель = "";  ЗначК1 = ""; ЗначК2 = "";  ЗначК3 = "";
	ОргНаим = ?(СколькоОрганизаций()=1,"",СокрЛП(Организация.Наименование));
	ЗначениеПредседатель = ВосстановитьЗначение("СотрудникПредседатель"+ОргНаим);
	Если ЗначениеПредседатель <> Неопределено Тогда
		Председатель = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеПредседатель.Наименование);
	КонецЕсли;
	ОбластьЗаголовок1.Параметры.Председатель = Председатель;
	
	ЗначениеК1 = ВосстановитьЗначение("СотрудникКомиссия1"+ОргНаим);
	Если ЗначениеК1 <> Неопределено Тогда
		ЗначК1 = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК1.Наименование);
	КонецЕсли;
	ОбластьЗаголовок1.Параметры.Комиссия1 = ЗначК1;
	
	ЗначениеК2 = ВосстановитьЗначение("СотрудникКомиссия2"+ОргНаим);
	Если ЗначениеК2 <> Неопределено Тогда
		ЗначК2 = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК2.Наименование);
		ОбластьЗаголовок1.Параметры.Комиссия2 = ЗначК2;
	КонецЕсли;
	
	ЗначениеК3 = ВосстановитьЗначение("СотрудникКомиссия3"+ОргНаим);
	Если ЗначениеК3 <> Неопределено Тогда
		ЗначК3 = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК3.Наименование);
		ОбластьЗаголовок1.Параметры.Комиссия3 = ЗначК3;
	КонецЕсли;
	//Аверсон 20.10.2021 КВВ СВФР-008283 )


	ТабДок.Вывести(ОбластьЗаголовок1);

	
		
	
	Возврат ТабДок;
	
	
КонецФункции


Функция ПечатьМакета1(Имя) экспорт
	//Аверсон 21.10.2020 КВВ СВФР-006710 (
	НесколькПротоколов = Ложь;
	З = Новый Запрос;
	З.Текст = "
	|ВЫБРАТЬ *
	|ИЗ Документ.ПротоколКомиссии КАК Протокол
	|ГДЕ Протокол.Проведен
	|И Протокол.НомерПротокола = &НомерПротокола
	|И Протокол.ДатаПротокола = &ДатаПротокола
	|И Протокол.Организация = &Организация
	|И Протокол.ЭтоНетрудоспособность";
	З.УстановитьПараметр("Организация",Организация);
	З.УстановитьПараметр("ДатаПротокола",ДатаПротокола);
	З.УстановитьПараметр("НомерПротокола",НомерПротокола);
	РезЗ = З.Выполнить().Выгрузить();
	Если РезЗ.Количество() > 1 Тогда
		Ответ = Вопрос("Найдено несколько протоколов от " + Формат(ДатаПротокола,"ДЛФ=Д") + " № " + СокрЛП(НомерПротокола) + "." + Символы.ПС + 
		"Обьединять в один протокол комиссии?",РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			НесколькПротоколов = Истина;
		КонецЕсли;
	КонецЕсли;
	//Аверсон 21.10.2020 КВВ СВФР-006710 )
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.ПротоколКомиссии.ПолучитьМакет("Макет1");
	// Заголовок
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	//Аверсон 21.10.2020 КВВ СВФР-006710 (
	ОбластьЗаголовок2 = Макет.ПолучитьОбласть("Заголовок2");
	ОбластьЗаголовок3 = Макет.ПолучитьОбласть("Заголовок3");
	ОбластьЗаголовок4 = Макет.ПолучитьОбласть("Заголовок4");
	ОбластьЗаголовок5 = Макет.ПолучитьОбласть("Заголовок5");
	//Аверсон 21.10.2020 КВВ СВФР-006710 )
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьЗаголовок1 = Макет.ПолучитьОбласть("Заголовок1");
	
	ОбластьЗаголовок.Параметры.Организация = ?(ЗначениеЗаполнено(Организация.НаименованиеПолное),Организация.НаименованиеПолное,Организация.Наименование);//Аверсон 21.10.2020 КВВ СВФР-006710
	ОбластьЗаголовок.Параметры.НомерПротокола = " " + СокрЛП(НомерПротокола) + " ";
	ОбластьЗаголовок.Параметры.ДатаПротокола = Формат(ДатаПротокола,"ДЛФ=Д");
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Если НЕ НесколькПротоколов Тогда //Аверсон 21.10.2020 КВВ СВФР-006710
		ФИО = Сотрудник.Наименование;
		ФИО = СтрЗаменить(ФИО,"Ё","Е");
		
		ФИОДат = ФИО;
		ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОДат, 3, Сотрудник.Физлицо.Пол,ФИОДат);
		ОбластьЗаголовок2.Параметры.ФИОДат = ФИОДат;
		
		ОбластьЗаголовок2.Параметры.СерияНомер = СерияВходящегоДокумента + НомерВходящегоДокумента;
		ОбластьЗаголовок2.Параметры.ДатаНачалаБ = Формат(ДатаНачалаБ,"ДЛФ=Д");
		ОбластьЗаголовок2.Параметры.ДатаОкончанияБ = Формат(ДатаОкончанияБ,"ДЛФ=Д");
		ОбластьЗаголовок2.Параметры.ПричинаНетрудоспособности = ПричинаНетрудоспособности;
		ОбластьЗаголовок2.Параметры.Обстоятельства = Обстоятельства;
		
		ТабДок.Вывести(ОбластьЗаголовок2);
		ТабДок.Вывести(ОбластьЗаголовок3);
		
		ОбластьЗаголовок4.Параметры.НомерПП = "1.";  //Аверсон 21.10.2020 КВВ СВФР-006710
		ОбластьЗаголовок4.Параметры.ФИОДат = ФИОДат;
		ОбластьЗаголовок4.Параметры.СерияНомер = СерияВходящегоДокумента + НомерВходящегоДокумента;
		ТабДок.Вывести(ОбластьЗаголовок4);
		
		Для Каждого стр из Оплата Цикл 
			ОбластьСтрока.Параметры.ДатаНачалаПособия = Формат(стр.ДатаНачала,"ДЛФ=Д");
			ОбластьСтрока.Параметры.ДатаОкончанияПособия = Формат(стр.ДатаОкончания,"ДЛФ=Д");
			ОбластьСтрока.Параметры.Процент = ?(ЗначениеЗаполнено(стр.Показатель1),СокрЛП(стр.Показатель1) + "%",""); //Аверсон 21.10.2020 КВВ СВФР-006710
			ТабДок.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		//Аверсон 21.10.2020 КВВ СВФР-006710 (
		ОбластьЗаголовок5.Параметры.НормПравАкт = СокрЛП(НормативноПравовойАкт); 
		ТабДок.Вывести(ОбластьЗаголовок5);
	Иначе //НесколькоПротоколов = Истина
		Для Каждого СтрТЗ ИЗ РезЗ Цикл
			ФИО = СтрТЗ.Сотрудник.Наименование;
			ФИО = СтрЗаменить(ФИО,"Ё","Е");
			ФИОДат = ФИО;
			ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОДат, 3, СтрТЗ.Сотрудник.Физлицо.Пол,ФИОДат);
			ОбластьЗаголовок2.Параметры.ФИОДат = ФИОДат;
			
			ОбластьЗаголовок2.Параметры.СерияНомер = СтрТЗ.СерияВходящегоДокумента + СтрТЗ.НомерВходящегоДокумента;
			ОбластьЗаголовок2.Параметры.ДатаНачалаБ = Формат(СтрТЗ.ДатаНачалаБ,"ДЛФ=Д");
			ОбластьЗаголовок2.Параметры.ДатаОкончанияБ = Формат(СтрТЗ.ДатаОкончанияБ,"ДЛФ=Д");
			ОбластьЗаголовок2.Параметры.ПричинаНетрудоспособности = СтрТЗ.ПричинаНетрудоспособности;
			ОбластьЗаголовок2.Параметры.Обстоятельства = СтрТЗ.Обстоятельства;
			
			ТабДок.Вывести(ОбластьЗаголовок2);
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьЗаголовок3);
		
		Для Каждого СтрТЗ ИЗ РезЗ Цикл
			ОбластьЗаголовок4.Параметры.НомерПП = "1." + СокрЛП(РезЗ.Индекс(СтрТЗ)+1) + ".";
			ФИО = СтрТЗ.Сотрудник.Наименование;
			ФИО = СтрЗаменить(ФИО,"Ё","Е");
			ФИОДат = ФИО;
			ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОДат, 3, СтрТЗ.Сотрудник.Физлицо.Пол,ФИОДат);
			ОбластьЗаголовок2.Параметры.ФИОДат = ФИОДат;
			
			ОбластьЗаголовок4.Параметры.СерияНомер = СтрТЗ.СерияВходящегоДокумента + СтрТЗ.НомерВходящегоДокумента;
			ТабДок.Вывести(ОбластьЗаголовок4);
			
			Для Каждого стр из СтрТЗ.Оплата Цикл 
				ОбластьСтрока.Параметры.ДатаНачалаПособия = Формат(стр.ДатаНачала,"ДЛФ=Д");
				ОбластьСтрока.Параметры.ДатаОкончанияПособия = Формат(стр.ДатаОкончания,"ДЛФ=Д");
				ОбластьСтрока.Параметры.Процент = ?(ЗначениеЗаполнено(стр.Показатель1),СокрЛП(стр.Показатель1) + "%",""); //Аверсон 21.10.2020 КВВ СВФР-006710
				ТабДок.Вывести(ОбластьСтрока);
			КонецЦикла;
			ОбластьЗаголовок5.Параметры.НормПравАкт = СокрЛП(СтрТЗ.НормативноПравовойАкт); 
			ТабДок.Вывести(ОбластьЗаголовок5);
		КонецЦикла;
	КонецЕсли;
	//Аверсон 21.10.2020 КВВ СВФР-006710 )
	
	//О.Т. Аверсон 06.12.2018 № 2879
	//ЗначениеПредседатель = ВосстановитьЗначение("СотрудникПредседатель");
	//Председатель = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеПредседатель.Наименование);
	//ОбластьЗаголовок1.Параметры.Председатель = Председатель;
	//ЗначениеК = ВосстановитьЗначение("СотрудникКомиссия1");
	//ЗначК = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК.Наименование);
	//ОбластьЗаголовок1.Параметры.Комиссия1 = ЗначК;
	//ЗначениеК = ВосстановитьЗначение("СотрудникКомиссия2");
	//ЗначК = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК.Наименование);
	//ОбластьЗаголовок1.Параметры.Комиссия2 = ЗначК;
	//ЗначениеК = ВосстановитьЗначение("СотрудникКомиссия3");
	//ЗначК = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК.Наименование);
	//ОбластьЗаголовок1.Параметры.Комиссия3 = ЗначК;
	//О.Т. Аверсон 06.12.2018 № 2879
	
	//Аверсон 20.10.2021 КВВ СВФР-008283 (
	Председатель = "";  ЗначК1 = ""; ЗначК2 = "";  ЗначК3 = "";
	ОргНаим = ?(СколькоОрганизаций()=1,"",СокрЛП(Организация.Наименование));
	ЗначениеПредседатель = ВосстановитьЗначение("СотрудникПредседатель"+ОргНаим);
	Если ЗначениеПредседатель <> Неопределено Тогда
		Председатель = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеПредседатель.Наименование);
	КонецЕсли;
	ОбластьЗаголовок1.Параметры.Председатель = Председатель;
	
	ЗначениеК1 = ВосстановитьЗначение("СотрудникКомиссия1"+ОргНаим);
	Если ЗначениеК1 <> Неопределено Тогда
		ЗначК1 = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК1.Наименование);
	КонецЕсли;
	ОбластьЗаголовок1.Параметры.Комиссия1 = ЗначК1;
	
	ЗначениеК2 = ВосстановитьЗначение("СотрудникКомиссия2"+ОргНаим);
	Если ЗначениеК2 <> Неопределено Тогда
		ЗначК2 = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК2.Наименование);
		ОбластьЗаголовок1.Параметры.Комиссия2 = ЗначК2;
	КонецЕсли;
	
	ЗначениеК3 = ВосстановитьЗначение("СотрудникКомиссия3"+ОргНаим);
	Если ЗначениеК3 <> Неопределено Тогда
		ЗначК3 = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗначениеК3.Наименование);
		ОбластьЗаголовок1.Параметры.Комиссия3 = ЗначК3;
	КонецЕсли;
	//Аверсон 20.10.2021 КВВ СВФР-008283 )
	
	ТабДок.Вывести(ОбластьЗаголовок1);
		
	
	Возврат ТабДок;
	
	
КонецФункции

Функция СколькоОрганизаций()   
	//Аверсон 20.10.2021 КВВ СВФР-008283 (
	З = Новый Запрос;
	З.Текст = "ВЫБРАТЬ 
	|Орг.Наименование
	|ИЗ Справочник.Организации КАК Орг  
	|ГДЕ Орг.ПометкаУдаления = ЛОЖЬ";
	РезЗ = З.Выполнить().Выгрузить().Количество();
	Возврат РезЗ;	
	//Аверсон 20.10.2021 КВВ СВФР-008283 )
КонецФункции
